from RPLCD.i2c import CharLCD
from time import sleep

bukva_B[8] = {0b11110, 0b10000, 0b`10000, 0b`11110, 0b10001, 0b10001, 0b11110, 0b00000, }; // Буква
"Б"
byte
bukva_G[8] = {0b11111, 0b10001, 0b10000, 0b10000, 0b10000, 0b10000, 0b10000, 0b00000, }; // Буква
"Г"
byte
bukva_D[8] = {0b01111, 0b00101, 0b00101, 0b01001, 0b10001, 0b11111, 0b10001, 0b00000, }; // Буква
"Д"
byte
bukva_ZH[8] = {0b10101, 0b10101, 0b10101, 0b11111, 0b10101, 0b10101, 0b10101, 0b00000, }; // Буква
"Ж"
byte
bukva_Z[8] = {0b01110, 0b10001, 0b00001, 0b00010, 0b00001, 0b10001, 0b01110, 0b00000, }; // Буква
"З"
byte
bukva_I[8] = {0b10001, 0b10011, 0b10011, 0b10101, 0b11001, 0b11001, 0b10001, 0b00000, }; // Буква
"И"
byte
bukva_IY[8] = {0b01110, 0b00000, 0b10001, 0b10011, 0b10101, 0b11001, 0b10001, 0b00000, }; // Буква
"Й"
byte
bukva_L[8] = {0b00011, 0b00111, 0b00101, 0b00101, 0b01101, 0b01001, 0b11001, 0b00000, }; // Буква
"Л"
byte
bukva_P[8] = {0b11111, 0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b10001, 0b00000, }; // Буква
"П"
byte
bukva_Y[8] = {0b10001, 0b10001, 0b10001, 0b01010, 0b00100, 0b01000, 0b10000, 0b00000, }; // Буква
"У"
byte
bukva_F[8] = {0b00100, 0b11111, 0b10101, 0b10101, 0b11111, 0b00100, 0b00100, 0b00000, }; // Буква
"Ф"
byte
bukva_TS[8] = {0b10010, 0b10010, 0b10010, 0b10010, 0b10010, 0b10010, 0b11111, 0b00001, }; // Буква
"Ц"
byte
bukva_CH[8] = {0b10001, 0b10001, 0b10001, 0b01111, 0b00001, 0b00001, 0b00001, 0b00000, }; // Буква
"Ч"
byte
bukva_Sh[8] = {0b10101, 0b10101, 0b10101, 0b10101, 0b10101, 0b10101, 0b11111, 0b00000, }; // Буква
"Ш"
byte
bukva_Shch[8] = {0b10101, 0b10101, 0b10101, 0b10101, 0b10101, 0b10101, 0b11111, 0b00001, }; // Буква
"Щ"
byte
bukva_Mz[8] = {0b10000, 0b10000, 0b10000, 0b11110, 0b10001, 0b10001, 0b11110, 0b00000, }; // Буква
"Ь"
byte
bukva_IYI[8] = {0b10001, 0b10001, 0b10001, 0b11001, 0b10101, 0b10101, 0b11001, 0b00000, }; // Буква
"Ы"
byte
bukva_Yu[8] = {0b10010, 0b10101, 0b10101, 0b11101, 0b10101, 0b10101, 0b10010, 0b00000, }; // Буква
"Ю"
byte
bukva_Ya[8] = {0b01111, 0b10001, 0b10001, 0b01111, 0b00101, 0b01001, 0b10001, 0b00000, }; // Буква
"Я"

lcd = CharLCD(i2c_expander='PCF8574', address=0x27, port=1,
              cols=20, rows=4, dotsize=8,
              charmap='A02',
              auto_linebreaks=True,
              backlight_enabled=True)

lcd.write_string('Привет')
sleep(2)

lcd.backlight_enabled = False

lcd.close(clear=True)